tutorials/barotropicCavitatingFoam/nozzle/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho             BICCG  1e-10 0.0;
    p               BICCG  1e-10 0.0;
 
    U               BICCG  1e-7  0.1;
    k               BICCG  1e-7  0.1;
    epsilon         BICCG  1e-7  0.1;
}

relaxationFactors
{
    p           0.2;
    U           0.5;
    k           0.5;
    epsilon     0.5;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
